"use strict";

// Какое будет выведено значение: 
// let x = 5; alert( ++x ); "5"

// Чему равно такое выражение:
//  console.log([ ] + false - null + true); "NaN"

// Что выведет этот код: 
// let y = 1; let x = y = 2; alert(x); "2"

// Чему равна сумма 
// [] + 1 + 2;
// console.log([] +1 + 2); "12"

// Что выведет этот код: 
// alert("1"[0] ); "1"

// Чему равно 
// 2 && 1 && null && 0 && undefined ; "null" ! && - И запинается на лжи

// Есть ли разница между выражениями? 
// !!( a && b ) и (a && b); - "не равны"

// Что выведет этот код: 
// alert( null || 2 && 3 || 4 ); "3" ИЛИ запинается на правде

// a = [1, 2, 3]; b = [1, 2, 3]; 
// Правда ли что a == b 

// Что выведет этот код: 
// alert( +"Infinity" ); "Infinity";

// Верно ли сравнение: 
// "Ёжик" > "яблоко"; "false"
// console.log("Ёжик" > "яблоко"); "false"

// Чему равно
//  0 || "" || 2 || undefined || true || falsе  "2"
// console.log(0 || "" || 2 || undefined || true || falsе); "2";